routes/web.php


  Route::get('/', [PostController::class,"showAll"])->name("homePage");

  Route::get('post/{post:slug}', [PostController::class,"show"]);

/*  Route::get(
      "categories/{category:slug}",
      fn (Category $category) => view("posts", [
        "posts" => $category->posts->load(["category","author"]), // the function load is used for eager loading of DB references
        "currentCategory" => $category,
        "categories" => Category::all()
    ])
  )->name("categoryRoute");*/

/*  Route::get(
      "authors/{author:username}",
      fn (User $author) => view("posts.showAll", [
        "posts" => $author->posts->load(["category","author"])
    ])
  );*/
---
SELECT * FROM `posts`
SELECT * FROM `categories` WHERE `categories`.`id` in (1)
SELECT * FROM `posts` WHERE `posts`.`category_id` = '1' and `posts`.`category_id` IS not NULL
SELECT * FROM `posts` WHERE `posts`.`category_id` = '3' and `posts`.`category_id` IS not NULL
SELECT * FROM `posts` WHERE `posts`.`user_id` = '1' and `posts`.`user_id` IS not NULL